CD2DSolidColorBrush.SetColor(D3DCOLORVALUE)
Specifies the color of this solid color brush
color: The color of this solid color brush

CD2DSolidColorBrush.#ctor(CRenderTarget*,D3DCOLORVALUE,CD2DBrushProperties*,System.Int32)
Constructs a CD2DSolidColorBrush object.
pParentTarget: A pointer to the render target.
color: The red, green, blue, and alpha values of the brush's color.
pBrushProperties: A pointer to the opacity and transformation of a brush.
bAutoDestroy: Indicates that the object will be destroyed by owner (pParentTarget).